cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'iandol/adobe-fonts'
tap 'sanemat/font'

brew 'ricty', args: ['with-powerline']
brew 'zsh'
brew 'zplug'
brew 'tmux'
brew 'tmuxinator'
brew 'git'
brew 'tig'
brew 'ghq'
brew 'neovim'
brew 'gperftools'
brew 'the_silver_searcher'
brew 'peco'
brew 'terminal-notifier'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'python@3.8'
brew 'go'
brew 'yarn'
brew 'nodebrew'

cask 'font-source-han-code-jp'
cask 'google-chrome'
cask 'google-drive'
cask 'google-japanese-ime'
cask 'microsoft-teams'
cask 'zoom'
cask 'kindle'
cask 'appcleaner'
cask 'iterm2'
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'docker'
cask 'sequel-pro'
cask 'charles'
cask 'sketch'
cask 'abstract'
# cask 'parallels'
cask 'stoplight-studio'

mas 'Bitwarden', id: 1352778147
mas 'Slack for Desktop', id: 803453959
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'CotEditor', id: 1024640650
mas 'The Unarchiver', id: 425424353
