cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'sanemat/font'

brew 'ricty', args: ['with-powerline']
brew 'zsh'
brew 'zplug'
brew 'tmux'
brew 'tmuxinator'
brew 'tig'
brew 'ghq'
brew 'neovim'
brew 'gperftools'
brew 'the_silver_searcher'
brew 'peco'
brew 'terminal-notifier'
brew 'python'
brew 'go'
brew 'yarn'

cask 'font-source-han-code-jp'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'microsoft-office'
cask 'libreoffice'
cask 'libreoffice-language-pack'
cask 'chatwork'
cask 'zoomus'
cask 'adobe-acrobat-reader'
cask 'appcleaner'
cask 'iterm2'
cask 'visual-studio-code'
cask 'intellij-idea-ce'
cask 'docker'
cask 'sequel-pro'
cask 'charles'
cask 'tunnelblick'
cask 'sketch'
cask 'abstract'
cask 'parallels'

mas '1Password 7 - Password Manager', id: 1333542190
mas 'Slack', id: 803453959
mas 'CotEditor', id: 1024640650
mas 'Cybozu Desktop', id: 905155357
# mas 'CopyClip', id: 595191960
mas 'The Unarchiver', id: 425424353
