cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'tkengo/highway'
tap 'neovim/neovim'

brew 'ghq'
brew 'neovim'
brew 'highway'
brew 'reattach-to-user-namespace'
brew 'rbenv'
brew 'ruby-build'
brew 'peco'
brew 'pyenv'
brew 'terminal-notifier'
brew 'zplug'
brew 'zsh'
brew 'tmux'
brew 'tig'

cask 'chefdk'
cask 'vagrant'
cask 'docker'
cask 'google-chrome'
cask 'firefox'
cask 'coteditor'
cask 'atom'
cask 'google-japanese-ime'
cask 'appcleaner'
cask 'iterm2'
cask 'libreoffice'
cask 'font-source-han-code-jp'
